<?php error_reporting(1);

// Напиши скрипт который будет показывать сколько секунд в часе сетках и неделе

//$a = 60 * 60;
//$b = 60 * 60 * 24;
//$c = 60 * 60 * 24 * 7;

$min = 60;
$hour = $min * 60;
$day = $hour * 24;
$week = $day * 7;

print "Кол-во секунд в часе: - {$hour} <br>";
print "Кол-во секунд в сутках: - {$day} <br>";
print "Кол-во секунд в неделе: - {$week} <br>";


$x = 60;
$x *=60;
print "<br>Кол-во секунд в часе: - {$x} <br>";
$x *= 24;
print "<br>Кол-во секунд в сутках: - {$x} <br>";
$x *= 7;
print "<br>Кол-во секунд в неделе: - {$x} <br>";