<?php error_reporting(-1);
//Оператор присваивания

//$a = 20;
//$a = $a + 3;
//$a += 3;

//$a = 2;
//$a = $a + 3 * 5; //17
//$a +=3 * 5; //17
//var_dump($a);

//Оператор присваивания по значению
$b1 = 3;
$b2 = $b1;
echo "<br>Оператор присваивания по значению<br>";
var_dump($b1, $b2);
$b1 = 5;
echo "<br>";
var_dump($b1, $b2);
$b2 = 10;
echo "<br>";
var_dump($b1, $b2);

//Оператор присваивания по ссылке
$c1 = 5;
$c2 =& $c1;
$c3 =& $c2;
echo "<br>Оператор присваивания по ссылке<br>";
var_dump($c1, $c2);
$c3 = 15;
echo "<br>";
var_dump($c1, $c2, $c3);